Documentation.org
#+TITLE: Development Documentation 
#+DESCRIPTION: Documentation for Developers 
#+KEYWORKDS: zotero papers docs documents patent search metadata notes haskell database 
#+STARTUP: contents 

* Development Documentation 
