Documentation.org
** REST API doc
*** End Points

The API has the following scheme:

| URL Route               | Description                                       |   |
|-------------------------+---------------------------------------------------+---|
| =/api=                  | Display the API documentation                     |   |
| =/api/colls=            | Returns all collections names and collections IDs |   |
| =/api/coll?id=20=       | Returns all items from collection which ID is 20  |   |
| =/api/item?id=10=       | Return the item which ID is 10                    |   |
| =/api/attachment?id=20= | Return a link to file of item  which ID is 10     |   |
|                         |                                                   |   |
*** Examples 
**** Get item by Id 

#+BEGIN_SRC json
  $ curl -s http://localhost:8000/api/item?id=17 |  python -mjson.tool
  {
      "mime": null,
      "colls": [
          [
              7,
              "Linux"
          ]
      ],
      "data": [
          [
              "url",
              "http://www.digilife.be/quickreferences/QRC/LINUX%20Admin%20Quick%20Reference.pdf"
          ],
          [
              "accessDate",
              "2016-11-07 22:06:48"
          ],
          [
              "title",
              "inux/Unix Command Line Cheat Sheet"
          ]
      ],
      "authors": [],
      "id": 17,
      "file": "6DHDAQAP/LINUX Admin Quick Reference.pdf",
      "tags": [
          [
              8,
              "quickref"
          ],
          [
              9,
              "linux"
          ]
      ]
  }

#+END_SRC

**** Get Collections 

Example: Querying the REST api with curl: 

Get collections:

#+BEGIN_SRC json
  $ curl -s http://localhost:8000/api/colls |  python -mjson.tool
  [
      {
          "name": "C++/CPP",
          "id": 8
      },
      {
          "name": "Fsharp",
          "id": 6
      },
      {
          "name": "Haskell",
          "id": 2
      },
      {
          "name": "Haskell Tutorials",
          "id": 5
      },
      {
          "name": "Haskell doc",
          "id": 3
      },
      {
          "name": "Linux",
          "id": 7
      }
  ]

#+END_SRC

**** Get all Items from a Collection 

Query all items wich belongs to collection Fsharp which id=6.

#+BEGIN_SRC json
  $ curl -s http://localhost:8000/api/colls?id=6 |  python -mjson.tool
  [
      {
          "mime": null,
          "colls": [
              [
                  6,
                  "Fsharp"
              ]
          ],
          "data": [
              [
                  "url",
                  "http://tomasp.net/articles/fsharp-i-introduction/article.pdf"
              ],
              [
                  "accessDate",
                  "2016-11-07 22:01:04"
              ],
              [
                  "title",
                  "F# Language Overview"
              ]
          ],
          "authors": [
              {
                  "first": "Tomas",
                  "last": "Petriceck",
                  "id": 4
              }
          ],
          "id": 12,
          "file": "678BV2HV/article.pdf",
          "tags": [
              [
                  2,
                  "fp"
              ],
              [
                  3,
                  "fsharp"
              ],
              [
                  4,
                  "doc"
              ],
              [
                  5,
                  "overview"
              ]
          ]
      },
      {
          "mime": null,
          "colls": [
              [
                  6,
                  "Fsharp"
              ]
          ],
          "data": [
              [
                  "url",
                  "http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"
              ],
              [
                  "accessDate",
                  "2016-11-07 22:00:06"
              ],
              [
                  "title",
                  "The F# 4.0 Language Specification"
              ]
          ],
          "authors": [
              {
                  "first": "Syme",
                  "last": "Don",
                  "id": 5
              },
              {
                  "first": "Alimov",
                  "last": "Anar",
                  "id": 6
              },
              {
                  "first": "Fischer",
                  "last": "Jomo",
                  "id": 7
              }
          ],
          "id": 13,
          "file": "A3APBZAZ/FSharpSpec-4.0-latest.pdf",
          "tags": [
              [
                  2,
                  "fp"
              ],
              [
                  3,
                  "fsharp"
              ],
              [
                  4,
                  "doc"
              ]
          ]
      }
  ]



#+END_SRC

