Documentation.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> REST API doc</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> End Points</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
The API has the following scheme:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">URL Route</th>
<th scope="col" class="left">Description</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>/api</code></td>
<td class="left">Display the API documentation</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>/api/colls</code></td>
<td class="left">Returns all collections names and collections IDs</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>/api/coll?id=20</code></td>
<td class="left">Returns all items from collection which ID is 20</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>/api/item?id=10</code></td>
<td class="left">Return the item which ID is 10</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><code>/api/attachment?id=20</code></td>
<td class="left">Return a link to file of item  which ID is 10</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Examples</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>Get item by Id<br  /><div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">

<pre class="src src-json">$ curl -s http://localhost:<span class="org-constant">8000</span>/api/item?id=<span class="org-constant">17</span> |  python -mjson.tool
{
    <span class="org-keyword">"mime"</span>: <span class="org-constant">null</span>,
    <span class="org-keyword">"colls"</span>: [
        [
            <span class="org-constant">7</span>,
            <span class="org-string">"Linux"</span>
        ]
    ],
    <span class="org-keyword">"data"</span>: [
        [
            <span class="org-string">"url"</span>,
            <span class="org-string">"http://www.digilife.be/quickreferences/QRC/LINUX%20Admin%20Quick%20Reference.pdf"</span>
        ],
        [
            <span class="org-string">"accessDate"</span>,
            <span class="org-string">"2016-11-07 22:06:48"</span>
        ],
        [
            <span class="org-string">"title"</span>,
            <span class="org-string">"inux/Unix Command Line Cheat Sheet"</span>
        ]
    ],
    <span class="org-keyword">"authors"</span>: [],
    <span class="org-keyword">"id"</span>: <span class="org-constant">17</span>,
    <span class="org-keyword">"file"</span>: <span class="org-string">"6DHDAQAP/LINUX Admin Quick Reference.pdf"</span>,
    <span class="org-keyword">"tags"</span>: [
        [
            <span class="org-constant">8</span>,
            <span class="org-string">"quickref"</span>
        ],
        [
            <span class="org-constant">9</span>,
            <span class="org-string">"linux"</span>
        ]
    ]
}
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>Get Collections<br  /><div class="outline-text-5" id="text-1-2-2-2">
<p>
Example: Querying the REST api with curl: 
</p>

<p>
Get collections:
</p>

<div class="org-src-container">

<pre class="src src-json">$ curl -s http://localhost:<span class="org-constant">8000</span>/api/colls |  python -mjson.tool
[
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"C++/CPP"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">8</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"Fsharp"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">6</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"Haskell"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">2</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"Haskell Tutorials"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">5</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"Haskell doc"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">3</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"Linux"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">7</span>
    }
]
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-3" name="sec-1-2-2-3"></a>Get all Items from a Collection<br  /><div class="outline-text-5" id="text-1-2-2-3">
<p>
Query all items wich belongs to collection Fsharp which id=6.
</p>

<div class="org-src-container">

<pre class="src src-json">$ curl -s http://localhost:<span class="org-constant">8000</span>/api/colls?id=<span class="org-constant">6</span> |  python -mjson.tool
[
    {
        <span class="org-keyword">"mime"</span>: <span class="org-constant">null</span>,
        <span class="org-keyword">"colls"</span>: [
            [
                <span class="org-constant">6</span>,
                <span class="org-string">"Fsharp"</span>
            ]
        ],
        <span class="org-keyword">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://tomasp.net/articles/fsharp-i-introduction/article.pdf"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:01:04"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"F# Language Overview"</span>
            ]
        ],
        <span class="org-keyword">"authors"</span>: [
            {
                <span class="org-keyword">"first"</span>: <span class="org-string">"Tomas"</span>,
                <span class="org-keyword">"last"</span>: <span class="org-string">"Petriceck"</span>,
                <span class="org-keyword">"id"</span>: <span class="org-constant">4</span>
            }
        ],
        <span class="org-keyword">"id"</span>: <span class="org-constant">12</span>,
        <span class="org-keyword">"file"</span>: <span class="org-string">"678BV2HV/article.pdf"</span>,
        <span class="org-keyword">"tags"</span>: [
            [
                <span class="org-constant">2</span>,
                <span class="org-string">"fp"</span>
            ],
            [
                <span class="org-constant">3</span>,
                <span class="org-string">"fsharp"</span>
            ],
            [
                <span class="org-constant">4</span>,
                <span class="org-string">"doc"</span>
            ],
            [
                <span class="org-constant">5</span>,
                <span class="org-string">"overview"</span>
            ]
        ]
    },
    {
        <span class="org-keyword">"mime"</span>: <span class="org-constant">null</span>,
        <span class="org-keyword">"colls"</span>: [
            [
                <span class="org-constant">6</span>,
                <span class="org-string">"Fsharp"</span>
            ]
        ],
        <span class="org-keyword">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://fsharp.org/specs/language-spec/4.0/FSharpSpec-4.0-latest.pdf"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:00:06"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"The F# 4.0 Language Specification"</span>
            ]
        ],
        <span class="org-keyword">"authors"</span>: [
            {
                <span class="org-keyword">"first"</span>: <span class="org-string">"Syme"</span>,
                <span class="org-keyword">"last"</span>: <span class="org-string">"Don"</span>,
                <span class="org-keyword">"id"</span>: <span class="org-constant">5</span>
            },
            {
                <span class="org-keyword">"first"</span>: <span class="org-string">"Alimov"</span>,
                <span class="org-keyword">"last"</span>: <span class="org-string">"Anar"</span>,
                <span class="org-keyword">"id"</span>: <span class="org-constant">6</span>
            },
            {
                <span class="org-keyword">"first"</span>: <span class="org-string">"Fischer"</span>,
                <span class="org-keyword">"last"</span>: <span class="org-string">"Jomo"</span>,
                <span class="org-keyword">"id"</span>: <span class="org-constant">7</span>
            }
        ],
        <span class="org-keyword">"id"</span>: <span class="org-constant">13</span>,
        <span class="org-keyword">"file"</span>: <span class="org-string">"A3APBZAZ/FSharpSpec-4.0-latest.pdf"</span>,
        <span class="org-keyword">"tags"</span>: [
            [
                <span class="org-constant">2</span>,
                <span class="org-string">"fp"</span>
            ],
            [
                <span class="org-constant">3</span>,
                <span class="org-string">"fsharp"</span>
            ],
            [
                <span class="org-constant">4</span>,
                <span class="org-string">"doc"</span>
            ]
        ]
    }
]
</pre>
</div>
</div>
</li>
