Documentation.org
**** Get all authors 

#+BEGIN_SRC json
$ curl -s http://localhost:8000/api/authors |  python -mjson.tool
[
    {
        "first": "",
        "last": "Center for History and New Media",
        "id": 1
    },
    {
        "first": "Alimov",
        "last": "Anar",
        "id": 6
    },
    {
        "first": "Alwyn",
        "last": "Goodloe",
        "id": 20
    },
    {
        "first": "Andrew D.",
        "last": "Gordon",
        "id": 15
    },
    {
        "first": "Dennis M.",
        "last": "Ritchie",
        "id": 9
    },
    {
        "first": "Fischer",
        "last": "Jomo",
        "id": 7
    },

...     ...      ...  ... 
    {
        "first": "Marc",
        "last": "Pouzet",
        "id": 23
    },
    {
        "first": "ONDREJ",
        "last": "\u0160UCH",
        "id": 17
    },
    {
        "first": "Ondrej",
        "last": "\u0160uch",
        "id": 22
    },
    {
        "first": "Paul",
        "last": "Cobbat",
        "id": 8
    },
    {
        "first": "Peter",
        "last": "Jankovic",
        "id": 21
    },
    {
        "first": "R",
        "last": "Hiptmar",
        "id": 13
    },
    {
        "first": "Syme",
        "last": "Don",
        "id": 5
    },
    {
        "first": "Tomas",
        "last": "Petriceck",
        "id": 4
    },
    {
        "first": "Wayne L.",
        "last": "Winston",
        "id": 11
    }
]

#+END_SRC

**** Get all items that belongs to an author 

#+BEGIN_SRC json
  $ curl -s http://localhost:8000/api/authors?id=10 |  python -mjson.tool
  [
      {
          "mime": null,
          "colls": [],
          "data": [
              [
                  "url",
                  "http://jetsonhacks.com/wp-content/uploads/2016/08/unix.pdf"
              ],
              [
                  "volume",
                  "17"
              ],
              [
                  "issue",
                  "7"
              ],
              [
                  "publicationTitle",
                  "Communications of the ACM"
              ],
              [
                  "date",
                  "1974-00-00 1974"
              ],
              [
                  "accessDate",
                  "2016-11-07 22:11:16"
              ],
              [
                  "libraryCatalog",
                  "Google Scholar"
              ],
              [
                  "title",
                  "The UNIX time-sharing system"
              ]
          ],
          "authors": [
              {
                  "first": "Dennis M.",
                  "last": "Ritchie",
                  "id": 9
              },
              {
                  "first": "Ken",
                  "last": "Thompson",
                  "id": 10
              }
          ],
          "id": 21,
          "file": "9NAZ5GJT/unix.pdf",
          "tags": []
      }
  ]

#+END_SRC

**** Get all tags 

#+BEGIN_SRC json
  $ curl -s http://localhost:8000/api/tags |  python -mjson.tool
  [
      {
          "name": "c++",
          "id": 10
      },
      {
          "name": "cpp",
          "id": 14
      },
      {
          "name": "doc",
          "id": 4
      },
      {
          "name": "fp",
          "id": 2
      },
      {
          "name": "frp",
          "id": 16
      },
      {
          "name": "fsharp",
          "id": 3
      },
      ... ... ...

      {
          "name": "numerical",
          "id": 11
      },
      {
          "name": "numerical methods",
          "id": 12
      },
      {
          "name": "overview",
          "id": 5
      },
      {
          "name": "quickref",
          "id": 8
      },
      {
          "name": "reactive",
          "id": 17
      },
      {
          "name": "simulation",
          "id": 15
      },
      {
          "name": "tutorial",
          "id": 7
      }
  ]
      
#+END_SRC

