Documentation.html

<li><a id="sec-1-2-2-4" name="sec-1-2-2-4"></a>Get all authors<br  /><div class="outline-text-5" id="text-1-2-2-4">
<div class="org-src-container">

<pre class="src src-json">$ curl -s http://localhost:<span class="org-constant">8000</span>/api/authors |  python -mjson.tool
[
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">""</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Center for History and New Media"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">1</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Alimov"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Anar"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">6</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Alwyn"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Goodloe"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">20</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Andrew D."</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Gordon"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">15</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Dennis M."</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Ritchie"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">9</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Fischer"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Jomo"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">7</span>
    },

...     ...      ...  ... 
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Marc"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Pouzet"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">23</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"ONDREJ"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"\u0160UCH"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">17</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Ondrej"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"\u0160uch"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">22</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Paul"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Cobbat"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">8</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Peter"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Jankovic"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">21</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"R"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Hiptmar"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">13</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Syme"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Don"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">5</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Tomas"</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Petriceck"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">4</span>
    },
    {
        <span class="org-keyword">"first"</span>: <span class="org-string">"Wayne L."</span>,
        <span class="org-keyword">"last"</span>: <span class="org-string">"Winston"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">11</span>
    }
]
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-5" name="sec-1-2-2-5"></a>Get all items that belongs to an author<br  /><div class="outline-text-5" id="text-1-2-2-5">
<div class="org-src-container">

<pre class="src src-json">$ curl -s http://localhost:<span class="org-constant">8000</span>/api/authors?id=<span class="org-constant">10</span> |  python -mjson.tool
[
    {
        <span class="org-keyword">"mime"</span>: <span class="org-constant">null</span>,
        <span class="org-keyword">"colls"</span>: [],
        <span class="org-keyword">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://jetsonhacks.com/wp-content/uploads/2016/08/unix.pdf"</span>
            ],
            [
                <span class="org-string">"volume"</span>,
                <span class="org-string">"17"</span>
            ],
            [
                <span class="org-string">"issue"</span>,
                <span class="org-string">"7"</span>
            ],
            [
                <span class="org-string">"publicationTitle"</span>,
                <span class="org-string">"Communications of the ACM"</span>
            ],
            [
                <span class="org-string">"date"</span>,
                <span class="org-string">"1974-00-00 1974"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:11:16"</span>
            ],
            [
                <span class="org-string">"libraryCatalog"</span>,
                <span class="org-string">"Google Scholar"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"The UNIX time-sharing system"</span>
            ]
        ],
        <span class="org-keyword">"authors"</span>: [
            {
                <span class="org-keyword">"first"</span>: <span class="org-string">"Dennis M."</span>,
                <span class="org-keyword">"last"</span>: <span class="org-string">"Ritchie"</span>,
                <span class="org-keyword">"id"</span>: <span class="org-constant">9</span>
            },
            {
                <span class="org-keyword">"first"</span>: <span class="org-string">"Ken"</span>,
                <span class="org-keyword">"last"</span>: <span class="org-string">"Thompson"</span>,
                <span class="org-keyword">"id"</span>: <span class="org-constant">10</span>
            }
        ],
        <span class="org-keyword">"id"</span>: <span class="org-constant">21</span>,
        <span class="org-keyword">"file"</span>: <span class="org-string">"9NAZ5GJT/unix.pdf"</span>,
        <span class="org-keyword">"tags"</span>: []
    }
]
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-6" name="sec-1-2-2-6"></a>Get all tags<br  /><div class="outline-text-5" id="text-1-2-2-6">
<div class="org-src-container">

<pre class="src src-json">$ curl -s http://localhost:<span class="org-constant">8000</span>/api/tags |  python -mjson.tool
[
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"c++"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">10</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"cpp"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">14</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"doc"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">4</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"fp"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">2</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"frp"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">16</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"fsharp"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">3</span>
    },
    ... ... ...

    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"numerical"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">11</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"numerical methods"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">12</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"overview"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">5</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"quickref"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">8</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"reactive"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">17</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"simulation"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">15</span>
    },
    {
        <span class="org-keyword">"name"</span>: <span class="org-string">"tutorial"</span>,
        <span class="org-keyword">"id"</span>: <span class="org-constant">7</span>
    }
]
</pre>
</div>
</div>
</li>
