Documentation.org
**** Get all items with a tag 

Get all items which contains the tag 'Linux' which Id=9.

#+BEGIN_SRC json
$ curl -s http://localhost:8000/api/tags?id=9 |  python -mjson.tool
[
    {
        "mime": null,
        "colls": [
            [
                7,
                "Linux"
            ]
        ],
        "data": [
            [
                "url",
                "http://www.linuxdevcenter.com/excerpt/LinuxPG_quickref/linux.pdf"
            ],
            [
                "accessDate",
                "2016-11-07 22:05:40"
            ],
            [
                "title",
                "Linux Quick Reference"
            ]
        ],
        "authors": [],
        "id": 15,
        "file": "ZJMVV5V8/linux.pdf",
        "tags": [
            [
                8,
                "quickref"
            ],
            [
                9,
                "linux"
            ]
        ]
    },
    {
        "mime": null,
        "colls": [
            [
                7,
                "Linux"
            ]
        ],
        "data": [
            [
                "url",
                "http://www.digilife.be/quickreferences/QRC/LINUX%20Admin%20Quick%20Reference.pdf"
            ],
            [
                "accessDate",
                "2016-11-07 22:06:48"
            ],
            [
                "title",
                "inux/Unix Command Line Cheat Sheet"
            ]
        ],
        "authors": [],
        "id": 17,
        "file": "6DHDAQAP/LINUX Admin Quick Reference.pdf",
        "tags": [
            [
                8,
                "quickref"
            ],
            [
                9,
                "linux"
            ]
        ]
    }
]

#+END_SRC

**** Search all items which title or word contains a string 

Search all items which contais the word 'cpp'

#+BEGIN_SRC sh
$ curl -s http://localhost:8000/api/search?content=cpp |  python -mjson.tool
[
    {
        "mime": null,
        "colls": [
            [
                8,
                "C++/CPP"
            ]
        ],
        "data": [
            [
                "url",
                "http://www.artima.com/samples/cpp11-14NotesSample.pdf"
            ],
            [
                "accessDate",
                "2016-11-07 22:16:31"
            ],
            [
                "title",
                "Overview of the New C++ (C++11) - cpp11-14NotesSample.pdf"
            ]
        ],
        "authors": [],
        "id": 23,
        "file": "NUGHRAQW/cpp11-14NotesSample.pdf",
        "tags": [
            [
                10,
                "c++"
            ]
        ]
    },
    {
        "mime": null,
        "colls": [],
        "data": [
            [
                "url",
                "http://www.sam.math.ethz.ch/~hiptmair/tmp/NumCSE/NumCSE15.pdf"
            ],
            [
                "accessDate",
                "2016-11-07 22:18:20"
            ],
            [
                "title",
                "NumCSE15.pdf"
            ]
        ],
        "authors": [],
        "id": 26,
        "file": "CGZ9CXT8/NumCSE15.pdf",
        "tags": []
    },
    {
        "mime": null,
        "colls": [],
        "data": [
            [
                "url",
                "http://www.sam.math.ethz.ch/~hiptmair/tmp/NumCSE/NumCSE15.pdf"
            ],
            [
                "accessDate",
                "2016-11-07 22:19:28"
            ],
            [
                "title",
                "NumCSE15.pdf"
            ]
        ],
        "authors": [],
        "id": 28,
        "file": "N8SXGHMN/NumCSE15.pdf",
        "tags": []
    }
]

#+END_SRC
** Haskell Related Documentation 

Happstack Sever Framework 

 - [[https://hackage.haskell.org/package/happstack-server][happstack-server: Web related tools and services.]]

Haskell SQLite Database Driver 

 - [[https://hackage.haskell.org/package/HDBC-sqlite3-2.3.3.1/docs/Database-HDBC-Sqlite3.html][Database.HDBC.Sqlite3]]

Haskell PostgresSQL Database Driver 

 - [[https://hackage.haskell.org/package/HDBC-postgresql][HDBC-postgresql: PostgreSQL driver for HDBC]]

Haskell AESON - Json library 

 - [[https://hackage.haskell.org/package/aeson][aeson: Fast JSON parsing and encoding]]
** Database Documentation 
