Documentation.html

<li><a id="sec-1-2-2-7" name="sec-1-2-2-7"></a>Get all items with a tag<br  /><div class="outline-text-5" id="text-1-2-2-7">
<p>
Get all items which contains the tag 'Linux' which Id=9.
</p>

<div class="org-src-container">

<pre class="src src-json">$ curl -s http://localhost:<span class="org-constant">8000</span>/api/tags?id=<span class="org-constant">9</span> |  python -mjson.tool
[
    {
        <span class="org-keyword">"mime"</span>: <span class="org-constant">null</span>,
        <span class="org-keyword">"colls"</span>: [
            [
                <span class="org-constant">7</span>,
                <span class="org-string">"Linux"</span>
            ]
        ],
        <span class="org-keyword">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://www.linuxdevcenter.com/excerpt/LinuxPG_quickref/linux.pdf"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:05:40"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"Linux Quick Reference"</span>
            ]
        ],
        <span class="org-keyword">"authors"</span>: [],
        <span class="org-keyword">"id"</span>: <span class="org-constant">15</span>,
        <span class="org-keyword">"file"</span>: <span class="org-string">"ZJMVV5V8/linux.pdf"</span>,
        <span class="org-keyword">"tags"</span>: [
            [
                <span class="org-constant">8</span>,
                <span class="org-string">"quickref"</span>
            ],
            [
                <span class="org-constant">9</span>,
                <span class="org-string">"linux"</span>
            ]
        ]
    },
    {
        <span class="org-keyword">"mime"</span>: <span class="org-constant">null</span>,
        <span class="org-keyword">"colls"</span>: [
            [
                <span class="org-constant">7</span>,
                <span class="org-string">"Linux"</span>
            ]
        ],
        <span class="org-keyword">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://www.digilife.be/quickreferences/QRC/LINUX%20Admin%20Quick%20Reference.pdf"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:06:48"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"inux/Unix Command Line Cheat Sheet"</span>
            ]
        ],
        <span class="org-keyword">"authors"</span>: [],
        <span class="org-keyword">"id"</span>: <span class="org-constant">17</span>,
        <span class="org-keyword">"file"</span>: <span class="org-string">"6DHDAQAP/LINUX Admin Quick Reference.pdf"</span>,
        <span class="org-keyword">"tags"</span>: [
            [
                <span class="org-constant">8</span>,
                <span class="org-string">"quickref"</span>
            ],
            [
                <span class="org-constant">9</span>,
                <span class="org-string">"linux"</span>
            ]
        ]
    }
]
</pre>
</div>
</div>
</li>

<li><a id="sec-1-2-2-8" name="sec-1-2-2-8"></a>Search all items which title or word contains a string<br  /><div class="outline-text-5" id="text-1-2-2-8">
<p>
Search all items which contais the word 'cpp'
</p>

<div class="org-src-container">

<pre class="src src-sh">$ curl -s http://localhost:8000/api/search?<span class="org-variable-name">content</span>=cpp |  python -mjson.tool
[
    {
        <span class="org-string">"mime"</span>: null,
        <span class="org-string">"colls"</span>: [
            [
                8,
                <span class="org-string">"C++/CPP"</span>
            ]
        ],
        <span class="org-string">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://www.artima.com/samples/cpp11-14NotesSample.pdf"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:16:31"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"Overview of the New C++ (C++11) - cpp11-14NotesSample.pdf"</span>
            ]
        ],
        <span class="org-string">"authors"</span>: [],
        <span class="org-string">"id"</span>: 23,
        <span class="org-string">"file"</span>: <span class="org-string">"NUGHRAQW/cpp11-14NotesSample.pdf"</span>,
        <span class="org-string">"tags"</span>: [
            [
                10,
                <span class="org-string">"c++"</span>
            ]
        ]
    },
    {
        <span class="org-string">"mime"</span>: null,
        <span class="org-string">"colls"</span>: [],
        <span class="org-string">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://www.sam.math.ethz.ch/~hiptmair/tmp/NumCSE/NumCSE15.pdf"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:18:20"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"NumCSE15.pdf"</span>
            ]
        ],
        <span class="org-string">"authors"</span>: [],
        <span class="org-string">"id"</span>: 26,
        <span class="org-string">"file"</span>: <span class="org-string">"CGZ9CXT8/NumCSE15.pdf"</span>,
        <span class="org-string">"tags"</span>: []
    },
    {
        <span class="org-string">"mime"</span>: null,
        <span class="org-string">"colls"</span>: [],
        <span class="org-string">"data"</span>: [
            [
                <span class="org-string">"url"</span>,
                <span class="org-string">"http://www.sam.math.ethz.ch/~hiptmair/tmp/NumCSE/NumCSE15.pdf"</span>
            ],
            [
                <span class="org-string">"accessDate"</span>,
                <span class="org-string">"2016-11-07 22:19:28"</span>
            ],
            [
                <span class="org-string">"title"</span>,
                <span class="org-string">"NumCSE15.pdf"</span>
            ]
        ],
        <span class="org-string">"authors"</span>: [],
        <span class="org-string">"id"</span>: 28,
        <span class="org-string">"file"</span>: <span class="org-string">"N8SXGHMN/NumCSE15.pdf"</span>,
        <span class="org-string">"tags"</span>: []
    }
]
</pre>
</div>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Haskell Related Documentation</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Happstack Sever Framework 
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/happstack-server">happstack-server: Web related tools and services.</a>
</li>
</ul>

<p>
Haskell SQLite Database Driver 
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/HDBC-sqlite3-2.3.3.1/docs/Database-HDBC-Sqlite3.html">Database.HDBC.Sqlite3</a>
</li>
</ul>

<p>
Haskell PostgresSQL Database Driver 
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/HDBC-postgresql">HDBC-postgresql: PostgreSQL driver for HDBC</a>
</li>
</ul>

<p>
Haskell AESON - Json library 
</p>

<ul class="org-ul">
<li><a href="https://hackage.haskell.org/package/aeson">aeson: Fast JSON parsing and encoding</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Database Documentation</h3>
