Documentation.org
*** Search Titles that contains a word 

Search all titles that contains the string "functional".

#+BEGIN_SRC sql 
SELECT itemData.itemID, itemDataValues.value  
FROM   itemData, itemDataValues, itemAttachments
WHERE  fieldID = 110 
AND    itemData.valueID = itemDataValues.valueID
AND    itemAttachments.sourceItemID = itemData.itemID
AND    itemDataValues.value LIKE "%functional%" 
#+END_SRC


#+BEGIN_SRC sql 
sqlite> 
sqlite> SELECT itemData.itemID, itemDataValues.value  
   ...> FROM   itemData, itemDataValues, itemAttachments
   ...> WHERE  fieldID = 110 
   ...> AND    itemData.valueID = itemDataValues.valueID
   ...> AND    itemAttachments.sourceItemID = itemData.itemID
   ...> AND    itemDataValues.value LIKE "%functional%" 
   ...> ;
1936|Functional Programming
2688|Currently struggling. Can someone help em transition from functional programming to using OOP? : learnpython
2750|When to use functional programming languages and techniques - TechRepublic
2752|Where functional programming fits in - TechRepublic
2754|Commercial Uses: Going functional on exotic trades
2772|Functional Programming in the Financial Industry | Open Parallel
2794|An introduction to functional programming
2798|functional programming | Math ∩ Programming
...
#+END_SRC
*** Search by a Regex Pattern 

#+BEGIN_SRC sql 
SELECT itemData.itemID, itemDataValues.value  
FROM   itemData, itemDataValues, itemAttachments
WHERE  fieldID = 110 
AND    itemData.valueID = itemDataValues.valueID
AND    itemAttachments.sourceItemID = itemData.itemID
AND    itemDataValues.value REGEXP "math.*" 
#+END_SRC

Result: 

#+BEGIN_SRC sql 
"2987"	"Functional Patterns for the non-mathematician"
"4842"	"Power of mathematics: Reasoning about functional types"
"6094"	"Discrete mathematics using a computer"
#+END_SRC
*** Text search. 
**** Search all items which title has a word 

Search all items that have the word "haskell".

#+BEGIN_SRC sql 
SELECT DISTINCT itemID 
FROM   fulltextItemWords, fulltextWords
WHERE  fulltextItemWords.wordID = fulltextWords.wordID
AND    fulltextWords.word LIKE "%haskell%"
#+END_SRC 

**** Search all itesm which title or content has a given word

Search all items that have the word "haskell" in the title or in the
content.

#+BEGIN_SRC sql 
SELECT itemData.itemID
FROM   itemData, itemDataValues, fulltextItemWords, fulltextWords
WHERE  itemData.fieldID = 110 
AND    itemDataValues.valueID = itemData.valueID
AND    fulltextItemWords.wordID = fulltextWords.wordID
AND    fulltextItemWords.itemID = itemData.itemID
AND    (itemDataValues.value LIKE "%haskell%"
	    OR  
		fulltextWords.word LIKE "%haskell%"
		)	

#+END_SRC

*** Insert Tag 

Insert a new tag if it doesn't exist and return its tagID or ID.

#+BEGIN_SRC sql 
  INSERT INTO tags (name, type, key)
  SELECT "DSL", 0, "XMFAMGDFAS" 
  -- Ensure that the tag is not inserted twice
  WHERE NOT EXISTS (SELECT 1 FROM tags WHERE name = "DSL") ; 
  -- Return the tagID of the new tag inserted or existing
  SELECT tagID FROM tags WHERE name = "DSL"
#+END_SRC

*** Search items which has at least one tag 

Search all items which has at least one tag of "haskell", "ffi", "fp", "functional"

#+BEGIN_SRC sql 
  SELECT itemTags.itemID, tags.tagID, tags.Name FROM itemTags, tags 
  WHERE  itemTags.tagID = tags.tagID and tags.Name IN ("haskell", "ffi", "fp", "functional")
#+END_SRC

Sample output: 

#+BEGIN_SRC text 
  itemID|tagID|name
  5766|182|haskell
  5792|182|haskell
  5920|182|haskell
  5928|182|haskell
  5928|189|fp
  5936|182|haskell
  5938|189|fp
  5943|182|haskell
  5946|189|fp
  5948|189|fp
  5950|189|fp
  5952|189|fp
  5954|189|fp
  5956|189|fp
  5958|189|fp
  5960|189|fp
  5962|189|fp
  5965|189|fp
  5907|182|haskell
  5907|189|fp
  5935|182|haskell
  5935|189|fp
  5969|182|haskell
  5969|189|fp
  5970|182|haskell
  5973|182|haskell
  5973|189|fp
  5975|182|haskell
  5975|189|fp
  5977|189|fp
  5979|189|fp
  5979|182|haskell
  5167|189|fp
  5980|182|haskell
  5980|189|fp
  5985|182|haskell
  5985|189|fp
  5988|182|haskell
  5988|189|fp
  5992|189|fp
  5992|182|haskell
  5994|182|haskell
  ... ... ... 
#+END_SRC

Refined search return only itemID 

#+BEGIN_SRC sql 
  SELECT DISTINCT itemTags.itemID FROM itemTags, tags 
  WHERE  itemTags.tagID = tags.tagID and tags.Name IN ("haskell", "ffi", "fp", "functional") ;        
#+END_SRC

Sample output:

#+BEGIN_SRC text 
  itemID
  5167
  5766
  5792
  5815
  5907
  5920
  5928
  5935
  5936

  ...
#+END_SRC
