Documentation.html
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Search Titles that contains a word</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Search all titles that contains the string "functional".
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> itemData.itemID, itemDataValues.<span class="org-keyword">value</span>  
<span class="org-keyword">FROM</span>   itemData, itemDataValues, itemAttachments
<span class="org-keyword">WHERE</span>  fieldID = 110 
<span class="org-keyword">AND</span>    itemData.valueID = itemDataValues.valueID
<span class="org-keyword">AND</span>    itemAttachments.sourceItemID = itemData.itemID
<span class="org-keyword">AND</span>    itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%functional%"
</pre>
</div>


<div class="org-src-container">

<pre class="src src-sql">sqlite&gt; 
sqlite&gt; <span class="org-keyword">SELECT</span> itemData.itemID, itemDataValues.<span class="org-keyword">value</span>  
   ...&gt; <span class="org-keyword">FROM</span>   itemData, itemDataValues, itemAttachments
   ...&gt; <span class="org-keyword">WHERE</span>  fieldID = 110 
   ...&gt; <span class="org-keyword">AND</span>    itemData.valueID = itemDataValues.valueID
   ...&gt; <span class="org-keyword">AND</span>    itemAttachments.sourceItemID = itemData.itemID
   ...&gt; <span class="org-keyword">AND</span>    itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%functional%" 
   ...&gt; ;
1936|Functional Programming
2688|Currently struggling. Can someone help em transition <span class="org-keyword">from</span> functional programming <span class="org-keyword">to</span> <span class="org-keyword">using</span> OOP? : learnpython
2750|<span class="org-keyword">When</span> <span class="org-keyword">to</span> use functional programming languages <span class="org-keyword">and</span> techniques - TechRepublic
2752|<span class="org-keyword">Where</span> functional programming fits <span class="org-keyword">in</span> - TechRepublic
2754|Commercial Uses: Going functional <span class="org-keyword">on</span> exotic trades
2772|Functional Programming <span class="org-keyword">in</span> the Financial Industry | <span class="org-keyword">Open</span> Parallel
2794|An introduction <span class="org-keyword">to</span> functional programming
2798|functional programming | Math &#8745; Programming
...
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Search by a Regex Pattern</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> itemData.itemID, itemDataValues.<span class="org-keyword">value</span>  
<span class="org-keyword">FROM</span>   itemData, itemDataValues, itemAttachments
<span class="org-keyword">WHERE</span>  fieldID = 110 
<span class="org-keyword">AND</span>    itemData.valueID = itemDataValues.valueID
<span class="org-keyword">AND</span>    itemAttachments.sourceItemID = itemData.itemID
<span class="org-keyword">AND</span>    itemDataValues.<span class="org-keyword">value</span> REGEXP "math.*"
</pre>
</div>

<p>
Result: 
</p>

<div class="org-src-container">

<pre class="src src-sql">"2987"  "Functional Patterns <span class="org-keyword">for</span> the non-mathematician"
"4842"  "Power <span class="org-keyword">of</span> mathematics: Reasoning about functional types"
"6094"  "Discrete mathematics <span class="org-keyword">using</span> a computer"
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Text search.</h4>
<div class="outline-text-4" id="text-1-4-3">
</div><ol class="org-ol"><li><a id="sec-1-4-3-1" name="sec-1-4-3-1"></a>Search all items which title has a word<br  /><div class="outline-text-5" id="text-1-4-3-1">
<p>
Search all items that have the word "haskell".
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> <span class="org-keyword">DISTINCT</span> itemID 
<span class="org-keyword">FROM</span>   fulltextItemWords, fulltextWords
<span class="org-keyword">WHERE</span>  fulltextItemWords.wordID = fulltextWords.wordID
<span class="org-keyword">AND</span>    fulltextWords.word <span class="org-keyword">LIKE</span> "%haskell%"
</pre>
</div>
</div>
</li>

<li><a id="sec-1-4-3-2" name="sec-1-4-3-2"></a>Search all itesm which title or content has a given word<br  /><div class="outline-text-5" id="text-1-4-3-2">
<p>
Search all items that have the word "haskell" in the title or in the
content.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> itemData.itemID
<span class="org-keyword">FROM</span>   itemData, itemDataValues, fulltextItemWords, fulltextWords
<span class="org-keyword">WHERE</span>  itemData.fieldID = 110 
<span class="org-keyword">AND</span>    itemDataValues.valueID = itemData.valueID
<span class="org-keyword">AND</span>    fulltextItemWords.wordID = fulltextWords.wordID
<span class="org-keyword">AND</span>    fulltextItemWords.itemID = itemData.itemID
<span class="org-keyword">AND</span>    (itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%haskell%"
        <span class="org-keyword">OR</span>  
        fulltextWords.word <span class="org-keyword">LIKE</span> "%haskell%"
        )
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> Insert Tag</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Insert a new tag if it doesn't exist and return its tagID or ID.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> tags (<span class="org-keyword">name</span>, <span class="org-keyword">type</span>, <span class="org-keyword">key</span>)
<span class="org-keyword">SELECT</span> "DSL", 0, "XMFAMGDFAS" 
<span class="org-comment">-- Ensure that the tag is not inserted twice</span>
<span class="org-keyword">WHERE</span> <span class="org-keyword">NOT</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> 1 <span class="org-keyword">FROM</span> tags <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = "DSL") ; 
<span class="org-comment">-- Return the tagID of the new tag inserted or existing</span>
<span class="org-keyword">SELECT</span> tagID <span class="org-keyword">FROM</span> tags <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = "DSL"
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> Search items which has at least one tag</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Search all items which has at least one tag of "haskell", "ffi", "fp", "functional"
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> itemTags.itemID, tags.tagID, tags.<span class="org-keyword">Name</span> <span class="org-keyword">FROM</span> itemTags, tags 
<span class="org-keyword">WHERE</span>  itemTags.tagID = tags.tagID <span class="org-keyword">and</span> tags.<span class="org-keyword">Name</span> <span class="org-keyword">IN</span> ("haskell", "ffi", "fp", "functional")
</pre>
</div>

<p>
Sample output: 
</p>

<div class="org-src-container">

<pre class="src src-text">itemID|tagID|name
5766|182|haskell
5792|182|haskell
5920|182|haskell
5928|182|haskell
5928|189|fp
5936|182|haskell
5938|189|fp
5943|182|haskell
5946|189|fp
5948|189|fp
5950|189|fp
5952|189|fp
5954|189|fp
5956|189|fp
5958|189|fp
5960|189|fp
5962|189|fp
5965|189|fp
5907|182|haskell
5907|189|fp
5935|182|haskell
5935|189|fp
5969|182|haskell
5969|189|fp
5970|182|haskell
5973|182|haskell
5973|189|fp
5975|182|haskell
5975|189|fp
5977|189|fp
5979|189|fp
5979|182|haskell
5167|189|fp
5980|182|haskell
5980|189|fp
5985|182|haskell
5985|189|fp
5988|182|haskell
5988|189|fp
5992|189|fp
5992|182|haskell
5994|182|haskell
... ... ...
</pre>
</div>

<p>
Refined search return only itemID 
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> <span class="org-keyword">DISTINCT</span> itemTags.itemID <span class="org-keyword">FROM</span> itemTags, tags 
<span class="org-keyword">WHERE</span>  itemTags.tagID = tags.tagID <span class="org-keyword">and</span> tags.<span class="org-keyword">Name</span> <span class="org-keyword">IN</span> ("haskell", "ffi", "fp", "functional") ;
</pre>
</div>

<p>
Sample output:
</p>

<div class="org-src-container">

<pre class="src src-text">itemID
5167
5766
5792
5815
5907
5920
5928
5935
5936

...
</pre>
</div>
</div>
</div>
