Documentation.org
*** Search all items which title at least match one of the word of a list 

#+BEGIN_SRC sql  
SELECT itemData.itemID, itemDataValues.value   
FROM   itemData, itemDataValues, itemAttachments
WHERE  fieldID = 110 
AND    itemData.valueID = itemDataValues.valueID
AND    itemAttachments.sourceItemID = itemData.itemID
AND    (    itemDataValues.value LIKE "%ocaml%"
        OR  itemDataValues.value LIKE "%haskell%"
		OR  itemDataValues.value LIKE "%functional%"
		OR  itemDataValues.value LIKE "%fsharp%"
		OR  itemDataValues.value LIKE "%monad%"
		)
GROUP BY itemData.itemID
#+END_SRC

Output:

#+BEGIN_SRC text 
  itemID|value
  1936|Functional Programming
  2688|Currently struggling. Can someone help em transition from functional programming to using OOP? : learnpython
  2740|Blow your mind - HaskellWiki
  2750|When to use functional programming languages and techniques - TechRepublic
  2752|Where functional programming fits in - TechRepublic

  ...  ... ... ...

  3019|Turning to the Functional Side using C# and F#.
  3703|Functional Programming in Javascript
  3705|Functional programming and the death of the Unix Way | Dan Newcome, blog
  4024|Learn Physics by Programming in Haskell [pdf] | Hacker News
  4027|Learn Physics by Programming in Haskell
  4030|Well-Typed - The Haskell Consultants: Monads: From Web 2.0 to Hardware Drivers

  .... ... ... ... ... 
#+END_SRC
*** Search all items which title contains all words in a list 


#+BEGIN_SRC sql  
SELECT itemData.itemID, itemDataValues.value   
FROM   itemData, itemDataValues, itemAttachments
WHERE  fieldID = 110 
AND    itemData.valueID = itemDataValues.valueID
AND    itemAttachments.sourceItemID = itemData.itemID
AND    (    itemDataValues.value LIKE "%ocaml%"
        OR  itemDataValues.value LIKE "%haskell%"
		OR  itemDataValues.value LIKE "%functional%"
		OR  itemDataValues.value LIKE "%fsharp%"
		OR  itemDataValues.value LIKE "%monad%"
		)
GROUP BY itemData.itemID
#+END_SRC
*** Search all items which title or tags matches all words in a list 

Selects all items which tag or title matches all "%ocaml%" or "%monad%".

#+BEGIN_SRC sql 
  SELECT itemData.itemID, itemDataValues.value   
  FROM   itemData, itemDataValues, itemAttachments, tags, itemTags 
  WHERE  fieldID = 110 
  AND    itemData.valueID = itemDataValues.valueID
  AND    itemAttachments.sourceItemID = itemData.itemID
  AND    itemTags.itemID = itemData.itemID
  AND    itemTags.tagID = tags.tagID
  AND    (     (itemDataValues.value LIKE "%ocaml%" OR tags.Name LIKE "%ocaml%")
          AND  (itemDataValues.value LIKE "%monad%" OR tags.Name LIKE  "%monad%")
          
          )
  GROUP BY itemData.itemID
#+END_SRC

