Documentation.html
<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> Search all items which title at least match one of the word of a list</h4>
<div class="outline-text-4" id="text-1-4-6">
<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> itemData.itemID, itemDataValues.<span class="org-keyword">value</span>   
<span class="org-keyword">FROM</span>   itemData, itemDataValues, itemAttachments
<span class="org-keyword">WHERE</span>  fieldID = 110 
<span class="org-keyword">AND</span>    itemData.valueID = itemDataValues.valueID
<span class="org-keyword">AND</span>    itemAttachments.sourceItemID = itemData.itemID
<span class="org-keyword">AND</span>    (    itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%ocaml%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%haskell%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%functional%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%fsharp%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%monad%"
        )
<span class="org-keyword">GROUP</span> <span class="org-keyword">BY</span> itemData.itemID
</pre>
</div>

<p>
Output:
</p>

<div class="org-src-container">

<pre class="src src-text">itemID|value
1936|Functional Programming
2688|Currently struggling. Can someone help em transition from functional programming to using OOP? : learnpython
2740|Blow your mind - HaskellWiki
2750|When to use functional programming languages and techniques - TechRepublic
2752|Where functional programming fits in - TechRepublic

...  ... ... ...

3019|Turning to the Functional Side using C# and F#.
3703|Functional Programming in Javascript
3705|Functional programming and the death of the Unix Way | Dan Newcome, blog
4024|Learn Physics by Programming in Haskell [pdf] | Hacker News
4027|Learn Physics by Programming in Haskell
4030|Well-Typed - The Haskell Consultants: Monads: From Web 2.0 to Hardware Drivers

.... ... ... ... ...
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7"><span class="section-number-4">1.4.7</span> Search all items which title contains all words in a list</h4>
<div class="outline-text-4" id="text-1-4-7">
<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> itemData.itemID, itemDataValues.<span class="org-keyword">value</span>   
<span class="org-keyword">FROM</span>   itemData, itemDataValues, itemAttachments
<span class="org-keyword">WHERE</span>  fieldID = 110 
<span class="org-keyword">AND</span>    itemData.valueID = itemDataValues.valueID
<span class="org-keyword">AND</span>    itemAttachments.sourceItemID = itemData.itemID
<span class="org-keyword">AND</span>    (    itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%ocaml%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%haskell%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%functional%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%fsharp%"
        <span class="org-keyword">OR</span>  itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%monad%"
        )
<span class="org-keyword">GROUP</span> <span class="org-keyword">BY</span> itemData.itemID
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-8" class="outline-4">
<h4 id="sec-1-4-8"><span class="section-number-4">1.4.8</span> Search all items which title or tags matches all words in a list</h4>
<div class="outline-text-4" id="text-1-4-8">
<p>
Selects all items which tag or title matches all "%ocaml%" or "%monad%".
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="org-keyword">SELECT</span> itemData.itemID, itemDataValues.<span class="org-keyword">value</span>   
<span class="org-keyword">FROM</span>   itemData, itemDataValues, itemAttachments, tags, itemTags 
<span class="org-keyword">WHERE</span>  fieldID = 110 
<span class="org-keyword">AND</span>    itemData.valueID = itemDataValues.valueID
<span class="org-keyword">AND</span>    itemAttachments.sourceItemID = itemData.itemID
<span class="org-keyword">AND</span>    itemTags.itemID = itemData.itemID
<span class="org-keyword">AND</span>    itemTags.tagID = tags.tagID
<span class="org-keyword">AND</span>    (     (itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%ocaml%" <span class="org-keyword">OR</span> tags.<span class="org-keyword">Name</span> <span class="org-keyword">LIKE</span> "%ocaml%")
        <span class="org-keyword">AND</span>  (itemDataValues.<span class="org-keyword">value</span> <span class="org-keyword">LIKE</span> "%monad%" <span class="org-keyword">OR</span> tags.<span class="org-keyword">Name</span> <span class="org-keyword">LIKE</span>  "%monad%")

        )
<span class="org-keyword">GROUP</span> <span class="org-keyword">BY</span> itemData.itemID
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues Soares Silva</p>
<p class="date">Created: 2017-02-19 dom 14:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
